# CannotAddParameterToFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotAddParameterToFamily Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Parameter '[Parameter]' cannot be added to the family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAddParameterToFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAddParameterToFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAddParameterToFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace